---
kind: property
id: P:Autodesk.Revit.DB.ColorFillScheme.IsLinkedFilesIncluded
source: html/128e90fd-f78f-42c5-e1a8-aa7a34363634.htm
---
# Autodesk.Revit.DB.ColorFillScheme.IsLinkedFilesIncluded Property

Represent if the scheme includes entries whose parameter values are based on elements from linked files.

## Syntax (C#)
```csharp
public bool IsLinkedFilesIncluded { get; set; }
```